<?php
/**
 * Created by PhpStorm.
 * User: lin.zhou
 * Date: 2019/1/14 0014
 * Time: 14:18
 */

return [
    0 => '成功',
    1 => '成功',
    2 => '请登录',

    10 => '活动时间尚未开始',
    11 => '该活动已经结束',
    12 => '每天只能点亮一次',
    13 => '角色名不能为空',
    14 => '区服 id 错误',
    15 => '手机号不正确',
    16 => '该手机号对应角色信息不正确',
    17 => '手机验证码不正确',
    18 => '礼包码已经领取完',
    19 => '获取角色信息错误',
    20 => '您今天已经分享',
    21 => '您的抽奖次数已经用完',
    22 => '注册时间未达到领取条件',
    23 => '姓名不能为空',
    24 => '手机号不正确',
    25 => '邮编不正确',
    26 => '地址不正确',
    27 => '该角色已经绑定手机号',
];