<?php
/**
 * Created by PhpStorm.
 * User: lin.zhou
 * Date: 2018/8/21
 * Time: 15:04
 */

return [
    0 => '成功',
    1 => '错误',
    2 => '内容不能为空',
    3 => '手机号不正确',
    4 => '请勿重复预约',
    5 => '设备类型不正确',
    6=>'验证码有误',

    //hero
    1001 => '点亮失败，邀请码不能为空',
    1002 => '没有该邀请人',
    1003 => '您已经帮他点亮拼图',
    1004 => '拼图已经完成',
    1005 => '拼图已经完成',
    1006 => '用户信息不存在，请重新登录',
    1007 => '您还未完成拼图，请完成后再领取',
    1008 => '您已经领取礼物',
    1009 => '用户信息不存在，请重新登录',
    1010 => '请领取礼包',
    1011 => '收件人名不合法',
    1012 => '手机不合法',
    1013 => '收件地址太长',
    1014 => '不能给自己点亮',
    1015 => '获取信息失败，请重新进入',
    1016 => '该礼包码不需要填写地址',
    1017 => '此分享链接已过期，快去告知好友重新分享吧',
    1018 => '时间已经过期，请重新分享',
    1019 => '获取数据失败，请重新进入',

    // ca
    2001 => '对不起，您的3次抽奖机会已用完',
    2003 => '名字不能为空',
    2004 => '抽奖次数已经用完',
    2005 => '邀请人信息不正确',
    2006 => '邀请码不正确',
    2007 => '不能为自己助力',
    2008 => '您已经为他助力',

    // lzsg
    3001 => '手机号不正确',
    3002 => '您已经预约，请勿重复预约',

    // wpys
    4001 => '选项格式不正确',
    4002 => '答案不能为空',
    4003 => '名字不能为空',
    4005 => '请重新登录',
    4006 => '名字不能超过8个字符',

    // wjyx
    5001 => '设备类型错误',
    5002 => '请选择区服',
    5003 => '请填写角色',
    5004 => '请登录',
    5005 => '已经完成抽奖',
    5006 => '领取失败',
    5007 => '不在活动时间内',
    5008 => '当天已经抽奖，请勿重复',
    5009 => '该角色当天已经抽奖，请勿重复',

    // dfzj
    6001 => '进攻次数已经用完',
    6002 => '舰长，我们已经完胜',
    6003 => '操作频繁',
    6004 => '领取对象错误',
    6005 => '领取对象错误',
    6006 => '未达到领取条件',
    6007 => '邀请码不正确',
    6008 => '邀请码不正确',
    6009 => '邀请码不正确',
    6010 => '您已经为他助力',
    6011 => '不能给自己助力',
    6012 => '礼包码已经领取完',
    6013 => '活动时间已经结束',
    6014 => '当天助力达到上限',
    6024 => 'type 类型不正确',
    6025 => '次数已经用完',
    6026 => '未达到领取条件',
    6027 => '请勿重复领取',
    6028 => '礼包码已经领取完',

    // cg
    7001 => '操作频繁',
    7002 => '活动已经结束',
    7003 => '活动将在10:00后开始',
    7004 => 'invite_code 参数错误',
    7005 => '该视频不存在',
    7006 => '留言类容不能为空',
    7007 => 'id 不正确',
    7008 => '无此条留言内容',
    7009 => '留言内容太长',
    7010 => '请勿重复点赞',

    // tk
    8001 => '类型不正确',
    8002 => '手机号不正确',
    8003 => '姓名不正确',
    8004 => '姓名不正确',
    8005 => '金额不正确',
    8006 => '时长不正确',
    8007 => '城市不正确',
    8010 => '选项不正确',
    8011 => '此手机号已参与过答题',
    8012 => '请输入昵称',
    8013 => '昵称不能超过10个字符',
    8014 => '手机号不正确',

    //sm
    9001=>'用户不存在',
    9002=>'加入失败,你已在此队伍中',
    9005=>'此队伍当天加入人数超过上限',
    9006=>'你已经加入5个队伍了，不能再加入了',
    9007=>'距离超出，不能加入',
    9003=>'创建失败',
    9004=>'你已经加入5个队伍了，不能再创建了',
    9009=>'您未中锦鲤',
    9010=>'学校信息有误,请稍后再试',
    9011=>'今天已经加入过战队了',
    9012=>'锦鲤还没产出',
    9013=>'你已经创建战队了',
    9014=>'活动已结束',

    // ca 春节回流
    7020 => '手机号不正确',
    7021 => '验证码不正确',
    7022 => '请登录',
    7023 => '抽奖机会已经用完',

    // ca 春节回流转盘抽奖
    7201 => '请重新登录',
    7202 => '抽奖机会已经用完',
];